# Subqueries Exercise

## Connect to the Database

In [1]:
%load_ext sql 

%config SqlMagic.displaylimit = 8

In [2]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

## Part 1: Single Row Subqueries
Single row subqueries <span style="color:yellow;">return only one row and one value.</span> Used with comparison operators: =, >, <, >=, <=, <>

### 1. Finding Above-Average Products
Write a query to display the product code, product name, and buy price of all products that have a buy price greater than the average buy price of all products.

In [5]:
%%sql
select AVG(buyPrice) from products

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+---------------------+
|         avg         |
+---------------------+
| 54.3951818181818182 |
+---------------------+

In [6]:
%%sql

select productCode,productName,buyPrice
from products
where buyPrice > (select AVG(buyPrice) from products)
# จะแสดงตารางที่มีราคาสินค้ามากกว่าค่าเฉลี่ยของราคาสินค้าทั้งหมด

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

54 rows affected.

+-------------+--------------------------------------+----------+
| productcode |             productname              | buyprice |
+-------------+--------------------------------------+----------+
|   S10_1949  |       1952 Alpine Renault 1300       |  98.58   |
|   S10_2016  |        1996 Moto Guzzi 1100i         |  68.99   |
|   S10_4698  | 2003 Harley-Davidson Eagle Drag Bike |  91.02   |
|   S10_4757  |         1972 Alfa Romeo GTA          |  85.68   |
|   S10_4962  |        1962 LanciaA Delta 16V        |  103.42  |
|   S12_1099  |          1968 Ford Mustang           |  95.34   |
|   S12_1108  |          2001 Ferrari Enzo           |  95.59   |
|   S12_1666  |            1958 Setra Bus            |   77.9   |
+-------------+--------------------------------------+----------+
Truncated to displaylimit of 8.

### 2. High Credit Customers
Write a query to find all customers whose credit limit is higher than the credit limit of customer number 103. Display the customer number, customer name, and credit limit.

In [7]:
%%sql

select creditLimit 
from customers 
where customerNumber = 103

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------+
| creditlimit |
+-------------+
|    21000    |
+-------------+

In [8]:
%%sql

select customerNumber, customerName, creditLimit
from customers
where creditLimit > (select creditLimit 
                        from customers 
                        where customerNumber = 103 )

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

96 rows affected.

+----------------+------------------------------+-------------+
| customernumber |         customername         | creditlimit |
+----------------+------------------------------+-------------+
|      112       |      Signal Gift Stores      |    71800    |
|      114       |  Australian Collectors, Co.  |    117300   |
|      119       |      La Rochelle Gifts       |    118200   |
|      121       |      Baane Mini Imports      |    81700    |
|      124       | Mini Gifts Distributors Ltd. |    210500   |
|      128       |     Blauer See Auto, Co.     |    59700    |
|      129       |       Mini Wheels Co.        |    64600    |
|      131       |      Land of Toys Inc.       |    114900   |
+----------------+------------------------------+-------------+
Truncated to displaylimit of 8.

### 3. Most Expensive Products
Write a query to find all products that have an MSRP equal to the maximum MSRP in the database. Display the product code, product name, product line, and MSRP.

In [9]:
%%sql

select productCode, productName, productLine, MSRP
from products
where MSRP = (select MAX(MSRP) from products)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------+--------------------------+--------------+-------+
| productcode |       productname        | productline  |  msrp |
+-------------+--------------------------+--------------+-------+
|   S10_1949  | 1952 Alpine Renault 1300 | Classic Cars | 214.3 |
+-------------+--------------------------+--------------+-------+

### 4. Customer with Maximum Credit
Write a query to display the customer number, customer name, and credit limit of the customer who has the same credit limit as the maximum credit limit in the database.

In [10]:
%%sql

SELECT customerNumber, customerName, creditLimit
FROM customers
WHERE creditLimit = (SELECT MAX(creditLimit) FROM customers);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+----------------+------------------------+-------------+
| customernumber |      customername      | creditlimit |
+----------------+------------------------+-------------+
|      141       | Euro+ Shopping Channel |    227600   |
+----------------+------------------------+-------------+

### 5. Office Location Query
Write a query to find all employees who work in the same officeCode as the office with officeCode '1'. Display the employee number, first name, last name.

In [11]:
%%sql

SELECT employeeNumber, firstName, lastName ,officeCode
FROM employees
WHERE officeCode = (select officeCode 
                        from offices
                        where officeCode = '1')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+----------------+-----------+-----------+------------+
| employeenumber | firstname |  lastname | officecode |
+----------------+-----------+-----------+------------+
|      1002      |   Diane   |   Murphy  |     1      |
|      1056      |    Mary   | Patterson |     1      |
|      1076      |    Jeff   |  Firrelli |     1      |
|      1143      |  Anthony  |    Bow    |     1      |
|      1165      |   Leslie  |  Jennings |     1      |
|      1166      |   Leslie  |  Thompson |     1      |
+----------------+-----------+-----------+------------+

## Part 2: Multiple Row Subqueries
Multiple row subqueries <span style="color:yellow;">return multiple rows. Often require GROUP BY and used with HAVING clause.</span> Use comparison with subqueries that compute aggregates per group.

### 6. Product Lines with Above-Average Products
Write a query to find product lines that have an average buy price greater than the overall average buy price of all products. Display the product line and its average buy price.

GROUP BY + HAVING:

- GROUP BY = จัดกลุ่มข้อมูล + ใช้ aggregate function (COUNT, SUM, AVG, MAX, MIN ฯลฯ)
- HAVING = กรองกลุ่มที่ตรงเงื่อนไข (เช่น COUNT > 5, SUM > 1000)
- ส่วน WHERE ใช้ก่อนจัดกลุ่ม (กรองแถวเดี่ยว) ไม่สามารถใช้ aggregate function ได้

In [12]:
%%sql

SELECT AVG(buyPrice) FROM products

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+---------------------+
|         avg         |
+---------------------+
| 54.3951818181818182 |
+---------------------+

In [13]:
%%sql

SELECT productLine, AVG(buyPrice) AS avgBuyPrice
FROM products
GROUP BY productLine
HAVING AVG(buyPrice) > (SELECT AVG(buyPrice) FROM products);

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

2 rows affected.

+------------------+---------------------+
|   productline    |     avgbuyprice     |
+------------------+---------------------+
|   Classic Cars   | 64.4463157894736842 |
| Trucks and Buses | 56.3290909090909091 |
+------------------+---------------------+

### 7. Customers with More Orders than Customer 103
Write a query to find customers who have placed more orders than customer number 103. Display the customer number, customer name, and total number of orders.

In [14]:
%%sql

SELECT *
from orders

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

326 rows affected.

+-------------+---------------------+---------------------+---------------------+---------+------------------------------------------------------------------------+----------------+
| ordernumber |      orderdate      |     requireddate    |     shippeddate     |  status |                                comments                                | customernumber |
+-------------+---------------------+---------------------+---------------------+---------+------------------------------------------------------------------------+----------------+
|    10100    | 2003-01-06 00:00:00 | 2003-01-13 00:00:00 | 2003-01-10 00:00:00 | Shipped |                                  None                                  |      363       |
|    10101    | 2003-01-09 00:00:00 | 2003-01-18 00:00:00 | 2003-01-11 00:00:00 | Shipped |                         Check on availability.                         |      128       |
|    10102    | 2003-01-10 00:00:00 | 2003-01-18 00:00:00 | 2003-01-14 00:00:00 | Shipped |                                  None                                  |      181       |
|    10103    | 2003-01-29 00:00:00 | 2003-02-07 00:00:00 | 2003-02-02 00:00:00 | Shipped |                                  None                                  |      121       |
|    10104    | 2003-01-31 00:00:00 | 2003-02-09 00:00:00 | 2003-02-01 00:00:00 | Shipped |                                  None                                  |      141       |
|    10105    | 2003-02-11 00:00:00 | 2003-02-21 00:00:00 | 2003-02-12 00:00:00 | Shipped |                                  None                                  |      145       |
|    10106    | 2003-02-17 00:00:00 | 2003-02-24 00:00:00 | 2003-02-21 00:00:00 | Shipped |                                  None                                  |      278       |
|    10107    | 2003-02-24 00:00:00 | 2003-03-03 00:00:00 | 2003-02-26 00:00:00 | Shipped | Difficult to negotiate with customer. We need more marketing materials |      131       |
+-------------+---------------------+---------------------+---------------------+---------+------------------------------------------------------------------------+----------------+
Truncated to displaylimit of 8.

In [15]:
%%sql

SELECT *
from customers

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

122 rows affected.

+----------------+------------------------------+-----------------+------------------+-------------------+------------------------------+--------------+------------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
| customernumber |         customername         | contactlastname | contactfirstname |       phone       |         addressline1         | addressline2 |    city    |  state   | postalcode |  country  | salesrepemployeenumber | creditlimit |                  customerlocation                  |
+----------------+------------------------------+-----------------+------------------+-------------------+------------------------------+--------------+------------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
|      103       |      Atelier graphique       |     Schmitt     |     Carine       |     40.32.2555    |        54, rue Royale        |     None     |   Nantes   |   None   |   44000    |   France  |          1370          |    21000    | 0101000020E61000006D31E47DC19B47405DA5BBEB6CE8F8BF |
|      112       |      Signal Gift Stores      |       King      |       Jean       |     7025551838    |       8489 Strong St.        |     None     | Las Vegas  |    NV    |   83030    |    USA    |          1166          |    71800    | 0101000020E6100000014F5AB8AC0E42406F0ED76A0FCB5CC0 |
|      114       |  Australian Collectors, Co.  |     Ferguson    |      Peter       |    03 9520 4555   |      636 St Kilda Road       |   Level 3    | Melbourne  | Victoria |    3004    | Australia |          1611          |    117300   | 0101000020E61000008F84228216E842C0E31698BAD01E6240 |
|      119       |      La Rochelle Gifts       |     Labrune     |     Janine       |     40.67.8555    | 67, rue des Cinquante Otages |     None     |   Nantes   |   None   |   44000    |   France  |          1370          |    118200   | 0101000020E61000006D31E47DC19B47405DA5BBEB6CE8F8BF |
|      121       |      Baane Mini Imports      |    Bergulfsen   |      Jonas       |     07-98 9555    |    Erling Skakkes gate 78    |     None     |  Stavern   |   None   |    4110    |   Norway  |          1504          |    81700    | 0101000020E6100000644227DFC77F4D4012D4957439122440 |
|      124       | Mini Gifts Distributors Ltd. |      Nelson     |      Susan       |     4155551450    |       5677 Strong St.        |     None     | San Rafael |    CA    |   97562    |    USA    |          1165          |    210500   | 0101000020E6100000214322C89CFC424055940156FDA15EC0 |
|      125       |      Havel & Zbyszek Co      | Piestrzeniewicz |     Zbyszek      |   (26) 642-7555   |       ul. Filtrowa 68        |     None     |  Warszawa  |   None   |   01-012   |   Poland  |          None          |      0      | 0101000020E610000037589302661D4A4096928A6B21033540 |
|      128       |     Blauer See Auto, Co.     |      Keitel     |      Roland      | +49 69 66 90 2555 |        Lyonerstr. 34         |     None     | Frankfurt  |   None   |   60528    |  Germany  |          1504          |    59700    | 0101000020E61000001E0FC704460E49405878F2446B5C2140 |
+----------------+------------------------------+-----------------+------------------+-------------------+------------------------------+--------------+------------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
Truncated to displaylimit of 8.

In [16]:
%%sql

select count(orderNumber) 
from orders 
where customerNumber = 103

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------+
| count |
+-------+
|   3   |
+-------+

In [17]:
%%sql

SELECT c.customerNumber, c.customerName, count(o.orderNumber) AS totalOrders
FROM customers c 
join orders o on c.customerNumber = o.customerNumber
group by c.customerNumber, c.customerName
having count(o.orderNumber) > (select count(*)
                                from orders 
                                where customerNumber = 103)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

24 rows affected.

+----------------+------------------------------+-------------+
| customernumber |         customername         | totalorders |
+----------------+------------------------------+-------------+
|      382       |    Salzburg Collectables     |      4      |
|      450       |  The Sharp Gifts Warehouse   |      4      |
|      276       |   Anna's Decorations, Ltd    |      4      |
|      323       |  Down Under Souveniers, Inc  |      5      |
|      114       |  Australian Collectors, Co.  |      5      |
|      124       | Mini Gifts Distributors Ltd. |      17     |
|      282       |  Souveniers And Things Co.   |      4      |
|      161       |     Technics Stores Inc.     |      4      |
+----------------+------------------------------+-------------+
Truncated to displaylimit of 8.

### 8. Offices with More Employees than Office '4'
Write a query to find offices that have more employees than office code '4'. Display the office code, city, and employee count.

In [18]:
%%sql

select * from offices

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+------------+---------------+------------------+--------------------------+--------------+------------+-----------+------------+-----------+----------------------------------------------------+
| officecode |      city     |      phone       |       addressline1       | addressline2 |   state    |  country  | postalcode | territory |                   officelocation                   |
+------------+---------------+------------------+--------------------------+--------------+------------+-----------+------------+-----------+----------------------------------------------------+
|     1      | San Francisco | +1 650 219 4782  |    100 Market Street     |  Suite 300   |     CA     |    USA    |   94080    |     NA    | 0101000020E61000003A58FFE730E34240D3DA34B6D79A5EC0 |
|     2      |     Boston    | +1 215 837 0825  |     1550 Court Place     |  Suite 102   |     MA     |    USA    |   02107    |     NA    | 0101000020E6100000B16F2711E12D4540C40B2252D3C351C0 |
|     3      |      NYC      | +1 212 555 3000  |   523 East 53rd Street   |   apt. 5A    |     NY     |    USA    |   10022    |     NA    | 0101000020E610000056664AEB6F5B44402DEA93DC618052C0 |
|     4      |     Paris     | +33 14 723 4404  | 43 Rue Jouffroy D'abbans |     None     |    None    |   France  |   75017    |    EMEA   | 0101000020E6100000FE47A643A76D4840B891B245D2CE0240 |
|     5      |     Tokyo     | +81 33 224 5000  |       4-1 Kioicho        |     None     | Chiyoda-Ku |   Japan   |  102-8578  |   Japan   | 0101000020E6100000027E8D2441D841404E0E9F7422766140 |
|     6      |     Sydney    | +61 2 9264 2451  |  5-11 Wentworth Avenue   |   Floor #2   |    NSW     | Australia |    2010    |    APAC   | 0101000020E6100000E4BCFF8F13EE40C06D1ADB6BC1E66240 |
|     7      |     London    | +44 20 7877 2041 |   25 Old Broad Street    |   Level 7    |    None    |     UK    |  EC2N 1HN  |    EMEA   | 0101000020E6100000B68311FB04C049402FF7C9518028C0BF |
+------------+---------------+------------------+--------------------------+--------------+------------+-----------+------------+-----------+----------------------------------------------------+

In [19]:
%%sql

select * from employees

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

23 rows affected.

+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
| employeenumber |  lastname | firstname | extension |              email              | reportsto |       jobtitle       | officecode |
+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
|      1002      |   Murphy  |   Diane   |   x5800   |   dmurphy@classicmodelcars.com  |    None   |      President       |     1      |
|      1056      | Patterson |    Mary   |   x4611   |  mpatterso@classicmodelcars.com |    1002   |       VP Sales       |     1      |
|      1076      |  Firrelli |    Jeff   |   x9273   |  jfirrelli@classicmodelcars.com |    1002   |     VP Marketing     |     1      |
|      1088      | Patterson |  William  |   x4871   | wpatterson@classicmodelcars.com |    1056   | Sales Manager (APAC) |     6      |
|      1102      |   Bondur  |   Gerard  |   x5408   |   gbondur@classicmodelcars.com  |    1056   | Sale Manager (EMEA)  |     4      |
|      1143      |    Bow    |  Anthony  |   x5428   |    abow@classicmodelcars.com    |    1056   |  Sales Manager (NA)  |     1      |
|      1165      |  Jennings |   Leslie  |   x3291   |  ljennings@classicmodelcars.com |    1143   |      Sales Rep       |     1      |
|      1166      |  Thompson |   Leslie  |   x4065   |  lthompson@classicmodelcars.com |    1143   |      Sales Rep       |     1      |
+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
Truncated to displaylimit of 8.

In [20]:
%%sql

select officeCode, city, country, count(employeeNumber)  as totalEmployees
from offices
join employees using (officeCode)
group by officeCode, city, country
having count(employeeNumber) > (select count(*)
                                  from employees 
                                  where officeCode = '4')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+------------+---------------+---------+----------------+
| officecode |      city     | country | totalemployees |
+------------+---------------+---------+----------------+
|     1      | San Francisco |   USA   |       6        |
+------------+---------------+---------+----------------+

### 9. Premium Product Lines
Write a query to find product lines where the maximum MSRP in that product line is greater than the average MSRP of all products. Display the product line and the maximum MSRP.

In [21]:
%%sql

select * from products

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

110 rows affected.

+-------------+---------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
| productcode |              productname              | productscale |      productvendor       |                                                                                                                                                                                                                                                 productdescription                                                                                                                                                                                                                                                | quantityinstock | buyprice |  msrp  | productline  |
+-------------+---------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
|   S10_1678  | 1969 Harley Davidson Ultimate Chopper |     1:10     |     Min Lin Diecast      |                                                                                                                                       This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive chain, wheels and steering. All parts are particularly delicate due to their precise scale and require special care and attention.                                                                                                                                      |       7933      |  48.81   |  95.7  | Motorcycles  |
|   S10_1949  |        1952 Alpine Renault 1300       |     1:10     | Classic Metal Creations  |                                                                                                                                                                                  Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                                  |       7305      |  98.58   | 214.3  | Classic Cars |
|   S10_2016  |         1996 Moto Guzzi 1100i         |     1:10     | Highway 66 Mini Classics |                                                      Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leather seats, luggage rack, dual exhaust pipes, small saddle bag located on handle bars, two-tone paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.                                                      |       6625      |  68.99   | 118.94 | Motorcycles  |
|   S10_4698  |  2003 Harley-Davidson Eagle Drag Bike |     1:10     |    Red Start Diecast     | Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-color tampo-printed graphics, separate engine drive belts, free-turning front fork, rotating tires and rear racing slick, certificate of authenticity, detailed engine, display stand\r\n, precision diecast replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine |       5582      |  91.02   | 193.66 | Motorcycles  |
|   S10_4757  |          1972 Alfa Romeo GTA          |     1:10     | Motor City Art Classics  |                                                                                                                                                                         Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                         |       3252      |  85.68   |  136   | Classic Cars |
|   S10_4962  |         1962 LanciaA Delta 16V        |     1:10     |   Second Gear Diecast    |                                                                                                                                                                         Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                         |       6791      |  103.42  | 147.74 | Classic Cars |
|   S12_1099  |           1968 Ford Mustang           |     1:12     |  Autoart Studio Design   |                                                                                                                                                                                   Hood, doors and trunk all open to reveal highly detailed interior features. Steering wheel actually turns the front wheels. Color dark green.                                                                                                                                                                                   |        68       |  95.34   | 194.57 | Classic Cars |
|   S12_1108  |           2001 Ferrari Enzo           |     1:12     |   Second Gear Diecast    |                                                                                                                                                                                  Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.                                                                                                                                                                                  |       3619      |  95.59   | 207.8  | Classic Cars |
+-------------+---------------------------------------+--------------+--------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+----------+--------+--------------+
Truncated to displaylimit of 8.

In [22]:
%%sql

select productLine, max(msrp) as max_msrp
from products
group by productLine
having max(msrp) > (select avg(msrp) from products)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+------------------+----------+
|   productline    | max_msrp |
+------------------+----------+
|   Classic Cars   |  214.3   |
|      Trains      |  100.84  |
|      Planes      |  157.69  |
| Trucks and Buses |  136.67  |
|   Vintage Cars   |   170    |
|   Motorcycles    |  193.66  |
|      Ships       |  122.89  |
+------------------+----------+

### 10. Customers with Higher Total Payments than Customer 103
Write a query to find customers whose total payment amount exceeds the total payment amount of customer 103. Display the customer number, customer name, and total payment amount.

In [23]:
%%sql

select * from payments

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

273 rows affected.

+-------------+---------------------+----------+----------------+
| checknumber |     paymentdate     |  amount  | customernumber |
+-------------+---------------------+----------+----------------+
|   HQ336336  | 2004-10-19 00:00:00 | 6066.78  |      103       |
|   JM555205  | 2003-06-05 00:00:00 | 14571.44 |      103       |
|   OM314933  | 2004-12-18 00:00:00 | 1676.14  |      103       |
|   BO864823  | 2004-12-17 00:00:00 | 14191.12 |      112       |
|   HQ55022   | 2003-06-06 00:00:00 | 32641.98 |      112       |
|   ND748579  | 2004-08-20 00:00:00 | 33347.88 |      112       |
|   GG31455   | 2003-05-20 00:00:00 | 45864.03 |      114       |
|   MA765515  | 2004-12-15 00:00:00 | 82261.22 |      114       |
+-------------+---------------------+----------+----------------+
Truncated to displaylimit of 8.

In [24]:
%%sql

select sum(amount)  as totalPayment
from payments
where customerNumber = 103

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+--------------+
| totalpayment |
+--------------+
|   22314.36   |
+--------------+

In [25]:
%%sql

select customerNumber, customerName, sum(amount) as totalPayment
from customers
join payments using (customerNumber)
group by customerNumber, customerName
having sum(amount)  > (select sum(amount) 
                        from payments
                        where customerNumber = 103)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

95 rows affected.

+----------------+-------------------------+--------------+
| customernumber |       customername      | totalpayment |
+----------------+-------------------------+--------------+
|      455       |     Super Scale Inc.    |   70378.65   |
|      448       | Scandinavian Gift Ideas |   76776.44   |
|      146       |  Saveley & Henriot, Co. |  130305.35   |
|      350       |   Marseille Mini Autos  |   71547.53   |
|      382       |  Salzburg Collectables  |   85060.00   |
|      314       |        Petit Auto       |   62253.85   |
|      386       |   L'ordine Souveniers   |   90143.31   |
|      278       |      Rovelli Gifts      |  127529.69   |
+----------------+-------------------------+--------------+
Truncated to displaylimit of 8.

## Part 3: Derived Tables / Subqueries in FROM Clause
Derived tables (also called inline views) are subqueries in the FROM clause used to create a temporary result set that can be further filtered, aggregated, or joined.
>Derived Table = subquery ที่อยู่ใน FROM clause เพื่อสร้างตารางชั่วคราว (temporary result set)

### 1. Customer Order Summary
Write a query to find the average number of orders per customer. First create a derived table that shows the count of orders for each customer, then calculate the average from that result.

In [26]:
%%sql

select customerNumber, count(*) as orderCounts
from orders
group by customerNumber

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

98 rows affected.

+----------------+-------------+
| customernumber | ordercounts |
+----------------+-------------+
|      209       |      3      |
|      347       |      2      |
|      455       |      2      |
|      181       |      3      |
|      321       |      4      |
|      205       |      3      |
|      448       |      3      |
|      146       |      3      |
+----------------+-------------+
Truncated to displaylimit of 8.

In [27]:
%%sql

select avg(orderCounts) as avgOrdersCounts
from (select customerNumber, count(*) as orderCounts
        from orders
        group by customerNumber) as customer_orders

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+--------------------+
|  avgorderscounts   |
+--------------------+
| 3.3265306122448980 |
+--------------------+

### 2. Top Product Lines by Revenue
Write a query to find product lines and their total revenue, then display only those product lines whose revenue is above 500,000. Use a subquery in the FROM clause to calculate revenue (quantityOrdered * priceEach) for each product line.

In [31]:
%%sql

select productLine, SUM(quantityOrdered * priceEach) AS totalRevenue
from products
join orderdetails using (productCode)
group by productLine

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+------------------+--------------+
|   productline    | totalrevenue |
+------------------+--------------+
|   Classic Cars   |  3853922.49  |
|      Trains      |  188532.92   |
|      Planes      |  954637.54   |
| Trucks and Buses |  1024113.57  |
|   Motorcycles    |  1121426.12  |
|   Vintage Cars   |  1797559.63  |
|      Ships       |  663998.34   |
+------------------+--------------+

In [32]:
%%sql

select productLine, totalRevenue
from (select productLine, SUM(quantityOrdered * priceEach) AS totalRevenue
        from products
        join orderdetails using (productCode)
        group by productLine) as revenue_per_productline
where totalRevenue > 500000

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+------------------+--------------+
|   productline    | totalrevenue |
+------------------+--------------+
|   Classic Cars   |  3853922.49  |
|      Planes      |  954637.54   |
| Trucks and Buses |  1024113.57  |
|   Motorcycles    |  1121426.12  |
|   Vintage Cars   |  1797559.63  |
|      Ships       |  663998.34   |
+------------------+--------------+

### 3. Employee Office Summary
Write a query to show each office's city along with the average number of customers handled by employees in that office. Use a derived table to first count customers per employee.

- สร้างตารางนับ customers per employee
- ข้อนี้ใน LEFT JOIN เพราะต้องการ 0 ไปคำนวนหา avg ด้วย
- ถ้า JOIN เฉยๆจะไม่เอา 0 มาคำนวนทำให้ค่า avg เพี้ยน

In [33]:
%%sql

SELECT e.officeCode, e.employeeNumber, COUNT(c.customerNumber) AS customerCount
                        FROM employees e
                        LEFT JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
                        GROUP BY e.employeeNumber, e.officeCode

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

23 rows affected.

+------------+----------------+---------------+
| officecode | employeenumber | customercount |
+------------+----------------+---------------+
|     1      |      1002      |       0       |
|     4      |      1102      |       0       |
|     6      |      1619      |       0       |
|     4      |      1370      |       7       |
|     4      |      1337      |       6       |
|     1      |      1056      |       0       |
|     4      |      1401      |       10      |
|     6      |      1611      |       5       |
+------------+----------------+---------------+
Truncated to displaylimit of 8.

In [45]:
%%sql

SELECT o.city, o.country, AVG(customerCount) AS avgCustomersPerEmployee
FROM offices o 
join (SELECT e.officeCode, e.employeeNumber, COUNT(c.customerNumber) AS customerCount
        FROM employees e
        LEFT JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
        GROUP BY e.employeeNumber, e.officeCode) AS emp_customer_counts
ON o.officeCode = emp_customer_counts.officeCode
GROUP BY o.city, o.country

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

7 rows affected.

+---------------+-----------+-------------------------+
|      city     |  country  | avgcustomersperemployee |
+---------------+-----------+-------------------------+
|     Paris     |   France  |    5.8000000000000000   |
|      NYC      |    USA    |    7.5000000000000000   |
| San Francisco |    USA    |    2.0000000000000000   |
|     London    |     UK    |    8.5000000000000000   |
|     Boston    |    USA    |    6.0000000000000000   |
|     Sydney    | Australia |    2.5000000000000000   |
|     Tokyo     |   Japan   |    2.5000000000000000   |
+---------------+-----------+-------------------------+

- `join orderDetails od ON o.orderNumber = od.orderNumber` คือเชื่อม orders กับ orderdetails ด้วยคีย์ออเดอร์ (1 ออเดอร์มีหลายบรรทัดรายละเอียด)
- `LEFT JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber` คือเอา พนักงานทุกคน มาไว้ฝั่งซ้าย แล้วจับคู่กับลูกค้าที่มี salesRepEmployeeNumber ตรงกับ employeeNumber ของพนักงาน
ถ้าพนักงานคนนั้นไม่มีลูกค้า → คอลัมน์ฝั่งลูกค้าเป็น NULL

![LEFT JOIN Diagram](../img/leftjoin.png)

### 4. High-Value Orders
Write a query to find the customer name and order number for orders that have a total value greater than 50,000. Use a subquery in the FROM clause to calculate the total value (SUM of quantityOrdered * priceEach) for each order.

In [36]:
%%sql
select * from orderdetails

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

2996 rows affected.

+-------------+-------------+-----------------+-----------+-----------------+
| ordernumber | productcode | quantityordered | priceeach | orderlinenumber |
+-------------+-------------+-----------------+-----------+-----------------+
|    10100    |   S18_1749  |        30       |    136    |        3        |
|    10100    |   S18_2248  |        50       |   55.09   |        2        |
|    10100    |   S18_4409  |        22       |   75.46   |        4        |
|    10100    |   S24_3969  |        49       |   35.29   |        1        |
|    10101    |   S18_2325  |        25       |   108.06  |        4        |
|    10101    |   S18_2795  |        26       |   167.06  |        1        |
|    10101    |   S24_1937  |        45       |   32.53   |        3        |
|    10101    |   S24_2022  |        46       |   44.35   |        2        |
+-------------+-------------+-----------------+-----------+-----------------+
Truncated to displaylimit of 8.

In [47]:
%%sql

select c.customerNumber, ov.orderNumber , ov.orderTotal
from customers c 
join (select o.customerNumber, o.orderNumber, sum(quantityOrdered * priceEach) as orderTotal
      from orders o
      join orderDetails od ON o.orderNumber = od.orderNumber
      group by o.customerNumber, o.orderNumber) as ov
ON c.customerNumber = ov.customerNumber
where ov.orderTotal > 50000

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

36 rows affected.

+----------------+-------------+------------+
| customernumber | ordernumber | ordertotal |
+----------------+-------------+------------+
|      204       |    10276    |  51152.86  |
|      386       |    10266    |  51619.02  |
|      205       |    10145    |  50342.74  |
|      161       |    10168    |  50743.65  |
|      350       |    10122    |  50824.66  |
|      227       |    10314    |  53745.34  |
|      382       |    10419    |  52420.07  |
|      256       |    10304    |  53116.99  |
+----------------+-------------+------------+
Truncated to displaylimit of 8.

### 5. Product Performance Ranking
Write a query to display product codes, product names, and their total quantity ordered. Then show only products that are in the top 10 by quantity ordered. Use a derived table to calculate total quantities.

In [41]:
%%sql

select p.productCode, p.productName, totalQuantity
from products p 
join( select productCode, sum(quantityOrdered) as totalQuantity
        from orderdetails 
        group by productCode) as ps
ON p.productCode = ps.productCode
order by totalQuantity desc
LIMIT 10

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

10 rows affected.

+-------------+-----------------------------------------+---------------+
| productcode |               productname               | totalquantity |
+-------------+-----------------------------------------+---------------+
|   S18_3232  |       1992 Ferrari 360 Spider red       |      1808     |
|   S18_1342  |           1937 Lincoln Berline          |      1111     |
|  S700_4002  |        American Airlines: MD-11S        |      1085     |
|   S18_3856  | 1941 Chevrolet Special Deluxe Cabriolet |      1076     |
|   S50_1341  |       1930 Buick Marquette Phaeton      |      1074     |
|   S18_4600  |             1940s Ford truck            |      1061     |
|   S10_1678  |  1969 Harley Davidson Ultimate Chopper  |      1057     |
|   S12_4473  |            1957 Chevy Pickup            |      1056     |
+-------------+-----------------------------------------+---------------+
Truncated to displaylimit of 8.